[{"index": 0, "text": "Sachin Tendulkar is India's first active cricketer to be nominated to the Rajya Sabha."}, {"index": 1, "text": "As an aspiring fast bowler, a young Sachin Tendulkar was rejected by Dennis Lillee's MRF Pace Foundation in 1987."}, {"index": 2, "text": "During the 1987 World Cup, Sachin was a ball boy for the match between India and Zimbabwe at the Wankhede Stadium. He was 14 then."}, {"index": 3, "text": "Sachin Tendulkar fielded for Pakistan as a substitute during a one-day practice match against India at the Brabourne Stadium in 1988."}, {"index": 4, "text": "During his early days, Tendulkar would win a coin from his coach Ramakant Achrekar if he could bat through an entire session of nets without being dismissed. Tendulkar has 13 such coins."}, {"index": 5, "text": "In October 1995, Sachin became the richest cricketer when he signed a five-year contract worth Rs.31.5 crore with World Tel."}, {"index": 6, "text": "Sachin Tendulkar used to sleep with his cricket gear during his junior days."}, {"index": 7, "text": "Sachin Tendulkar loves collecting perfumes and watches."}, {"index": 8, "text": "Tendulkar's first car was a Maruti-800."}, {"index": 9, "text": "Sachin Tendulkar was the first international batsman to be given out by a third-umpire. In 1992, on the second day of the Durban Test, a Jonty Rhodes throw caught Tendulkar short of the crease. After watching TV replays, he was adjudged out. Karl Liebenberg of South Africa was the third umpire in the match."}, {"index": 10, "text": "At 19, Sachin Tendulkar became the youngest Indian to play county cricket."}, {"index": 11, "text": "The first advertisement in which Sachin featured was for a sticking plaster."}, {"index": 12, "text": "The first brand which Sachin Tendulkar endorsed was the health drink 'Boost.' He was seen alongside Kapil Dev in many of their ad films, the start of which happened in 1990."}, {"index": 13, "text": "In his debut Test match, English fast bowler Alan Mullally complained that Sachin Tendulkar was batting with a bat broader than the normal willow."}, {"index": 14, "text": "Sachin Tendulkar started off with centuries in his debut matches in the Ranji, Duleep and Irani Trophy."}, {"index": 15, "text": "Sachin Tendulkar was led onto the field on his Ranji debut by his then captain, Ravi Shastri."}, {"index": 16, "text": "Sachin Tendulkar uses a very heavy bat at the crease, weighing 3.2lbs. Only South Africa`s Lance Klusener used a heavier bat in world cricket."}, {"index": 17, "text": "Sachin Tendulkar, who is considered as a calm character, was a big bully in the school."}, {"index": 18, "text": "Sachin Tendulkar went to watch the movie Roja in 1995 with a beard and disguise. It all went wrong when his glasses fell off and the crowd in the cinema hall recognized him."}, {"index": 19, "text": "Sachin Tendulkar has been granted the Rajiv Gandhi Khel Ratna, Arjuna Award and Padma Shri by the Indian government. He is the only Indian cricketer to get all of them."}, {"index": 20, "text": "When young Sachin fell from a tree on a Sunday evening during his summer vacation, while Guide was shown on national TV, his infuriated brother (and mentor) Ajit sent him to cricket coaching class as a punishment."}, {"index": 21, "text": "The naughty Sachin Tendulkar used to go fishing for tadpoles and guppy fishes in the stream that ran through the compound of Sahitya Sahawas at Bandra East."}, {"index": 22, "text": "Sachin Tendulkar once told a Marathi news channel in an interview that his weakness is `vada-pao`, a popular Maharashtrian snack."}, {"index": 23, "text": "Sachin used his favorite vampire bat during the innings in which he scored the historical 50th Test ton."}, {"index": 24, "text": "Sachin Tendulkar batted in his debut Test against Pakistan wearing the pads gifted to him by Sunil Gavaskar."}, {"index": 25, "text": "Sachin Tendulkar was a huge fan of John McEnroe, a former tennis legend. He grew his hair and tied a band around it to copy his idol."}, {"index": 26, "text": "Tendulkar has scored most centuries in a calendar year: 9 ODI centuries in 1998."}, {"index": 27, "text": "In 1998, he made 1,894 ODI runs, a record for ODI runs by any batsman in a calendar year."}, {"index": 28, "text": "Sachin Tendulkar is himself a role model for many admirers from other sports such as tennis stars Pete Sampras and Boris Becker, and Argentina footballer Diego Maradona."}, {"index": 29, "text": "Sachin Tendulkar was named after the great musician Sachin Dev Burman. Sachin's father Ramesh Tendulkar, was a big fan of SD's music."}, {"index": 30, "text": "Sachin loves Kishore Kumar and rock group Dire Straits."}, {"index": 31, "text": "Sachin calls Sourav Ganguly `Babu Moshai` while Ganguly calls him `Chhota Babu`."}, {"index": 32, "text": "Sachin once made his mother look for a frog Bhaji recipe!"}, {"index": 33, "text": "The nanny who looked after Sachin has been universally called Sachuchi Bai."}, {"index": 34, "text": "Sachin is so possessive about his Ferrari that wife Anjali is not allowed to drive it."}, {"index": 35, "text": "Sachin loved to play tennis ball cricket and darts during rain breaks."}, {"index": 36, "text": "A prankster that he is, Sachin once put a hose pipe into Sourav Ganguly's room and turned the tap on."}, {"index": 37, "text": "Sachin Tendulkar was without a bat contract until the start of the 1996 Cricket World Cup. At the end of the tournament, a famous tyre manufacturer sponsored his willow."}, {"index": 38, "text": "In 1992, Sachin became the youngest cricketer to reach a 1000 runs in Test cricket."}, {"index": 39, "text": "Tendulkar is the only player who has 40 wickets and more than 11000 runs in Tests."},{"index": 40, "text": "Sachin Tendulkar is India's youngest and first sportsperson to be awarded the Bharat Ratna."}]