[{"quote":"When you bowl at him you are not just trying to get him out, you are trying to impress him. I want him to walk off thinking that Flintoff, he's all right isn't he? I feel privileged to have played against him","name":"Andrew Flintoff"},{"quote":"You can't contain Sachin's deeds in a statistical frame. He brings unstinted joy to the art of batting. Statistics will happen because cricket is about runs and wickets. But how can you evaluate Sachin's contributions by just counting the number of runs he has scored. To me, he best symbolises the heights an individual can rise to dominate a team sport. Words can never capture the beauty of Sachin's cricket.","name":"Kapil Dev"},{"quote":"When you play against Tendulkar, you almost want to see him get a few runs just to see him bat.","name":"Mark Waugh"},{"quote":"I have played with him long enough to understand his approach but I am amazed at the man's zeal. He wants to be perfect always. His humility is amazing. I have seen Sachin carry drinks for the juniormost, much to the embarrassment of the youngster. His discipline is infectious. For Mumbai nets, he comes in the Mumbai training gear. He would never don an India cap or T-shirt for a Mumbai match. He will also not allow anyone to carry his cricket coffin.","name":"Pravin Amre"},{"quote":"Sachin Tendulkar is, in my time, the best player without doubt - daylight second, Brian Lara third.","name":"Shane Warne"},{"quote":"He is 99.5% Perfect.. I'll pay to watch him play. I think he is marvellous. I think he will fit in whatever category of Cricket that has been played or will be played, from the first ball that has ever been bowled to the last ball that's going to be. He can play in any era and at any level.","name":"Viv Richards"},{"quote":"I saw him playing on television and was struck by his technique, so I asked my wife to come look at him. Now I never saw myself play, but I feel that this player is playing much the same as I used to play, and she looked at him on Television and said yes, there is a similarity between the two...hi compactness, technique, stroke production... it all seemed to gel! in reference to Sachin Tendulkar.","name":"Sir Don Bradman"},{"quote":"Consensus is that Sir Donald Bradman was the best batsman ever to play Cricket. Sir Don did not play One-Day Cricket but if he did, he could easily be Sachin Tendulkar.","name":"Barry Richards"},{"quote":"In my several years of international cricket, Tendulkar remains the best batsman I have ever bowled to. It's been a pleasure to bowl at the master batsman even though one hasn't always emerged with credit from the engagements. During our team meetings, we often speak about the importance of the first 12 balls to Tendulkar. If you get him then you can thank your stars, otherwise it could mean that tough times lie ahead.","name":"Allan Donald"},{"quote":"In the recently concluded IPL when Sachin drove Ishant Sharma to a straight drive, he said- Open the text book..turn to page no. 32","name":"Harsha Bhogle"},{"quote":"wrote on an aussie t-shirt he autographed specially for Sachin.  To Sachin, the man we all want to be ","name":"Andrew Symonds"},{"quote":"Well, I'm no Sachin Tendulkar you know, whenever he takes the field, people expect him to score a century before he loses his wicket. I can only give in my best and I always strive to live up to fans expectations, but it is not possible to get an Oscar every time.","name":"A R Rahman"},{"quote":"Both of us have come a long away and it is a great honour that Tendulkar thinks I come close to resembling him as a batsman. It is a great honour, like a dream come true. If I die tomorrow I'll be the happiest man because I played this game because of Tendulkar, and Tendulkar himself saying that I resemble him - there is no bigger compliment than that.","name":"Virendra Sehwag"},{"quote":"I have seen GOD , he bats at no.4 for india in Tests.","name":"Mathew Hayden"},{"quote":"He is someone sent from up there to play cricket and go back.","name":"Ravi Shashtri"},{"quote":"We did not lose to a team called india...we lost to a man called Sachin.","name":"Mark Taylor"},{"quote":"Sachin is a genius , i am a mere mortal!","name":"Brain Lara"},{"quote":"Sachin is crickets GOD","name":"Barry Richards"},{"quote":"The shot played on this ball is only possible for the GOD of cricket.","name":"Martin Crowe"},{"quote":"What we [zimbabwe] need is 10 tendulkars.","name":"Paul Strang"},{"quote":"There is no shame losing to such a great player(sachin).","name":"Steve Waugh"},{"quote":"I would go to bed having nightmares of sachin dancing down the ground and hitting me for sixes.","name":"Shane Warne"},{"quote":"His life seems to be a stillness in a frantic world... [When he goes out to bat], it is beyond chaos - it is a frantic appeal by a nation to one man. The people see him as a God...","name":"Mathew Hayden"},{"quote":"If I had to bowl to Sachin I would bowl with a halmet on. He hits the ball so hard.","name":"Dennis Lillie"},{"quote":"After being defeated in the Coca-Cola Cup finals in Sharjah) It was one of the greatest innings I have ever seen. There is no shame being beaten by such a great player, Sachin is perhaps only next to the Don''","name":"Steve Waugh"},{"quote":"Don't bowl him bad balls, he hits the good ones for fours.","name":"Michael Kasprowicz"},{"quote":"I'll be going to bed having nightmares of Sachin just running down the wicket and belting me back over the head for six. He was unstoppable. I don't think anyone, apart from Don Bradman, is in the same class as Sachin Tendulkar. He is just an amazing player.","name":"Shane Warne"},{"quote":"Today, he showed the world why he is considered the best batsman around. Some of the shots he played were simply amazing. Earlier, opposing teams used to feel that Sachin's dismissal meant they could win the game. Today, I feel that the Indian players, too, feel this way. Wasim Akram, after game at Hobart, CUB series, 1999","name":"Wasim Akram"},{"quote":"You might pitch a ball on the off stump and think you have bowled a good ball and he walks across and hits it for two behind midwicket. His bat looks so heavy but he just waves it around like it's a toothpick. Brett Lee, on Sachin Tendulkar's batting, 1999","name":"Brett Lee"},{"quote":"Beneath the helmet, under that unruly curly hair, inside the cranium, there is something we don't know, something beyond scientific measure. Something that allows him to soar, to roam a territory of sport that, forget us, even those who are gifted enough to play alongside him cannot even fathom. When he goes out to bat, people switch on their television sets and switch off their lives.","name":"BBC Sports"},{"quote":"I dont know what to bowl at him. i bowled an inswinger and he drove me through covers of d front foot. then i bowledd an outswinger and he again punched through covers of the backfoot. he is d toughest batsmen i have bowled to. He shold live long and score lots of runs, but not against pakistan(smiling) - on 24th april 2004 on espn Sachin's 30th birthday program.","name":"Wasim Akram"},{"quote":"India's fortune will depend on how many runs the little champion scores. There is no doubt Tendulkar is the real thing.","name":"Sunil Gavaskar"},{"quote":"He has defined cricket in his fabulous, impeccable manner. He is to batting what Shane Warne is to bowling.","name":"Richie Benaud"},{"quote":"Technically, you can't fault Sachin. Seam or spin, fast or slow nothing is a problem.","name":"Geoffrey Boycott"},{"quote":"He is Sachin Tendulkar. I hope he stays Sachin Tendulkar. We need a new player, a player in his own way. He has a technique which is the hallmark of a great player. Everything indicates that he will be a great player and I am sure he will prove me right. Reminds me of Barry Richards.","name":"Eddie Barlow"},{"quote":"He is a perfectly balanced batsman and knows perfectly well when to attack and when to play defensive cricket. He has developed the ability to treat bowlers all over the world with contempt and can destroy any attack with utmost ease.","name":"Greg Chappell"},{"quote":"I Was fielding in the covers Tendulkar came out to bat in his debut Test at Karachi. I still remember Waqar Younis was at his peak form at that time. Tendulkar tried to drive Waqar through the covers off his very first ball in Test cricket but was beaten all ends up. But I walked to captain Imran Khan and told him 'this kid looks very good' and Imran agree with me.","name":"Abdul Qadir"},{"quote":"I have watched a lot of Tendulkar and we have spoken to each other a lot. He has it in him to be among the very best.","name":"Sir Garfield Sobers"},{"quote":"Sometime back I had written a piece that said that Sachin's the master and Lara a genius with his head high up somewhere. That's it!","name":"Peter Roebuck"},{"quote":"Sachin is an attacker. He has much more power than Sunny. He wants to be the one to set the pace. He has to be on top. That's the buzz about him.","name":"Jeff Thompson"},{"quote":"Tendulkar is the most comouncy pitch with Hughes, McDermott and Whitney gunning for him he only had 60-odd when No 11 came in. I've seen him against Warne too.","name":"Ian Healy"},{"quote":"Sachin's the best. I've had this view since I saw him score that hundred in Sydney in 1992. He's the most composed batsman I've ever seen.","name":"Mike Coward"},{"quote":"Nothing bad can happen to us if we're on a plane in India with Sachin Tendulkar on it. Hashim Amla, the South African batsman, reassures himself as he boards a flight.","name":"Hashim Amla"},{"quote":"Maybe the country doesn't pray for me like they do for Sachin Tendulkar, but I know I'm on a good wicket as well.","name":"Shahrukh Khan"},{"quote":"Sachin was so focused. He never looked like getting out. He was batting with single-minded devotion. It was truly remarkable. It was a lesson. Tennis legend joins the Sachin Tendulkar fan club after watching him bat at Sydney.","name":"Martina Navratilova"},{"quote":"After loosing to India in the Coca Cola Cup final at Sharjah in November '98. He has everything a top batsman needs. Tendulkar is a classic example of a player being so good that his age is an irrelevance","name":"Alistair Campbell"},{"quote":"Technically he stands out as the best because of his ability to increase the pace at will","name":"David Boon"},{"quote":"I have always felt C. K. Nayadu was the best. I now think sachin has the honour of being the most outstanding batsman of all time.","name":"Vasant Raiji"},{"quote":"You take Don Bradman away and he is next up I reckon.","name":"Steve Waugh"},{"quote":"In an over I can bowl six different balls. But then Sachin looks at me with a sort of gentle arrogance down the pitch as if to say 'Can you bowl me another one?'","name":"Adam Hollioke"},{"quote":"He is cool, has magnificent temperament, and is so mature you tend to forget his age. I can't think of any other example of a player who has so dominated the world before the age of 25.","name":"Tony Greig"},{"quote":"Hell, if he stayed, even at 11 an over he would have got it.","name":"Allan Border"},{"quote":"I can't dream of an innings like that. He exists where we can't.","name":"Ajay Jadeja"},{"quote":"In the last session in Nagpur, when the Indian chase was still on, Tendulkar hit a reverse sweep, an orthodox sweep and a lofted cover drive to (Ian) Blackwell. They were all exquisite cricket shots. To play those shots deliberately in such quick succession, off almost similar deliveries, was genius. That was a little jewel, just those 3-4 minutes. It reminds you how very few people are special. It was a case of great thinking and good technique.","name":"David Gower"},{"quote":"I sat in the office of Sportsweek magazine with that same Sunil Gavaskar. Ayaz Memon and I were listening to Gavaskar in one of his rare, priceless moods. The ?Little Master? was delving deep into his own experience, his own genius, and bringing forth pearls of wisdom as sudden, and as effective, as his straight- drives back past the bowler. Then Gavaskar came up with the following statement (remember, this was in 1988, when Dilip Vengsarkar was about to become captain of India): The two best batsmen in Bombay today are Vengsarkar and Sachin Tendulkar. Full stop. End of statement. The ball crosses the boundary-line underneath the sight- screen.","name":"Sunil Gavaskar"},{"quote":"In terms of technique and compactness, Tendulkar is the best: Desmond Haynes.","name":"Desmond Haynes"},{"quote":"He's a phenomenon. We have to be switched on when he plays allow him no boundries, for then he doesn't stop.","name":"Mark Taylor"},{"quote":"Cricketers like Sachin come once in a lifetime and I am privileged he played in my time Tuzhe pata hai tune kiska catch chhoda hai? Wasim Akram to Abdul Razzaq when the latter dropped Sachin's catch.","name":"Wasim Akram"},{"quote":"His shot selection is superb, he just lines you up and can make you look very silly. Everything is right in his technique and judgement. There isn't a fault there. He is also a lovely guy, and over the years I've enjoyed some interesting chats with him Sachin is in a different class to Lara as a professional cricketer. He is a model cricketer, and despite the intolerable pressures he faces back home, he remains a really nice guy Sachin is also the best batsman in the world, pulling away from Brain Lara every year.","name":"Allan Donald"},{"quote":"he's shy little gentleman. I am very privileged to have played with him and seen most of the runs that he has scored. I am also extremely happy to have shared the same dressing room... He is a very reserved person and generally keeps to himself. He is very determined, committed and doesn't show too many emotions. He just goes about doing his job. The thing I admire most about this man is his poise. The way he moves, elegantly without ever looking out of place in any condition or company, suggests his pedigree. I remember he had once come to New Delhi in the 1990s to collect his Arjuna Award (India's highest award to its top sportspersons) and he asked me if I would attend the function. He is a very sensitive human being. Sometimes you feel he really hasn't felt the kind of competition in the world his talent deserves. I would have loved to see him perform against top quality cricketers of the previous generation. It would really have brought out the best in him.","name":"Anil Kumble"},{"quote":"Tendulkar is the best in the world at the moment. Why I've always liked him is that batsmen tend to be negative at times and I think batting is not about not getting out - it is to play positively. I think you got to take it to the bowlers and Sachin is one such player. When you do so, you change the game, you change bowlers because they suddenly start bowling badly because they are under pressure.","name":"Greame Pollock"},{"quote":"Whenever I see Sachin play I am reminded of the Graeme Pollock quote of Cricket being a 'see the ball, hit the ball game.' He hits the ball as if it's there to be hit.","name":"Ian Chappell"},{"quote":"We always knew that Sachin Tendulkar is a great cricketer, but after the Coca-Cola Cup here, we have seen the birth of a legend. I can't think of anybody who has batted more authoritatively in one day cricket for India, or even in the world except for Vivian Richards.","name":"Ravi Shastri"},{"quote":"His mind is like a computer. He stores data on bowlers and knows where they are going to pitch the ball.","name":"Navjot Sidhu"},{"quote":"We did not lose to a team called India, we lost to a man called Sachin - Mark Taylor, during the test match in Chennai (1997)","name":"Mark Taylor"},{"quote":"Playing in the same team as Sachin is a huge honour. His balance of mind, shrewd judgement, modesty and, above all, his technical brilliance make him my all-time hero... You can't get a more complete cricketer than Sachin. He has everything that a cricketer needs to have. As a batsman, he has the technique, the hunger and the desire for runs. He always contributes with the bat as well as on the field. He also is a good fielder and bowls when needs. You really can't ask for a better cricketer than Sachin... He is a terrific person and has handled pressure brilliantly. He has handled his success very well and doesn't have any airs about him. He is a great guy and very good team man. In his heart of hearts, he is a very simple and down to earth person.","name":"Rahul Dravid"},{"quote":"The more I see him, the more I want to see him.","name":"Azhar"},{"quote":"India's fortune will depend on how many runs the little champion scores. There is no doubt Tendulkar is the real thing.","name":"Sunil Gavaskar"},{"quote":"if sachin plays well, India sleeps well.","name":"Harsha Bhogle"},{"quote":"The thing I like most about Sachin is his intensity. After being in the game for so long, he still has the same desire to do well for India in any international match.I tell you what, this man is a legend.","name":"Saurav Ganguly"},{"quote":"He is the only match-winning batsman we have","name":"Kris Srikkanth"},{"quote":"You get him out and half the battle is won","name":"Arjuna Ranatunga"},{"quote":"There are 2 kind of batsmen in the world. One Sachin Tendulkar. Two all the others.","name":"Andy Flower"},{"quote":"A flighted full toss on Leg stump by spinner. any other will play this shot on leg side by pull shot or glance or flick. but sachin made a space and played a perfect cover drive for four runs.","name":"Martin Crowe"},{"quote":"You have to decide for yourself whether you're bowling well or not. He's going to hit you for fours and sixes anyway. Kasprowicz has a superior story. During the Bangalore Test, frustrated, he went to Dennis Lillee and asked, Mate, do you see any weaknesses? Lillee replied, No Michael, as long as you walk off with your pride that's all you can do.","name":"Shane Warne"},{"quote":"I never get tired during umpiring whenever sachin is on crease","name":"Rudy Kortzen"},{"quote":"This was after a wonderful century by sachin(in england i guess in a test match..not sure). The other day i was just trying to think of a bowler who can go through sachin's defenses when sachin is in total defense. I am sorry but i could not think of even one name who could do that. If sachin decides he doesnt want to give away his wicket, he wont. be it any bowler in the world. Cheers to Sachin.","name":"Sunil Gavaskar"},{"quote":"Sachin is the best ever batsman in the world. He is brilliant in his technique. He is always hungry for runs.Sachin is better than Lara in his techniques & thats why he is No.1 among others.On his day, Lara wiil be more destructive. He is the only man 2 fight for west indies. Jayasuriya also played great knocks for his team. But compared to them Sachin is the BEST","name":"Ricky Ponting"},{"quote":"Barely two hours after landing in Johannesburg on the 1992-93 tour to South Africa, the team was to visit Tolstoy Farm, Mahatma Gandhi's first Satyagrahi Commune founded in 1910. It was situated 35 kms from Jo'burg and most of the Indian players showed little interest, longing to rest in the hotel after the long flight. But Tendulkar, still a teenager, looked keen and hungry to learn more about Gandhi. His volley of questions to the guide reflected his national pride.","name":"NKP Salve"},{"quote":"Sachin is the most complete batsman I have seen. His technique is so good and he has played well in all conditions. To have 41 one-day international tons shows what an appetite he has for scoring runs.","name":"Ricky Ponting"},{"quote":"There's no better sight on the cricket field than watch Tendulkar bat.","name":"Harsha Bhogle"},{"quote":"Sachin Tendulkar! If he isn't the best player in the world, I want to see the best player in the world.","name":"Rev David Shepherd"}]