[{"record": "Highest run getter in test matches (15,921).", "index": 0}, {"record": "Highest run getter in ODIs (18,426).", "index": 1}, {"record": "15,310 of his runs came while opening the innings with the aid of 45 centuries and 75 fifties in 340 innings- most by an opener.", "index": 2}, {"record": "Most number of centuries in Test matches – 51.", "index": 3}, {"record": "Most number of centuries in ODIs – 49.", "index": 4}, {"record": "Most number of man of the match awards (62) in the ODIs. Sanath Jayasuriya with 48 is second. The third on the list is South Africa’s Jacques Kallis with 32 awards.", "index": 5}, {"record": "Most number of man of the series awards (17) in ODIs.", "index": 6}, {"record": "Best average for man of the matches in ODIs.", "index": 7}, {"record": "First cricketer to reach 10,000–11,000–12,000–13,000–14,000–15,000–16,000–17,000–18,000 runs in the ODIs.", "index": 8}, {"record": "Only player ever to cross the 14,000–15,000–16,000–17,000 and 18,000 run marks in ODIs.", "index": 9}, {"record": "He is the highest run scorer in World Cups (2,278 at an average of 56.95)", "index": 10}, {"record": "Most number of the man of the match awards in World cups.", "index": 11}, {"record": "Most number of runs in the 1996 World cup – 523 runs at an average of 87.16.", "index": 12}, {"record": "Most number of runs in the 2003 World cup – 673 runs in 2003 Cricket World Cup, highest by any player in a single Cricket World Cup.", "index": 13}, {"record": "Most number of Fifties in ODIs – 96.", "index": 14}, {"record": "Highest number of 50+ scores in ODI’s – 145 (49 Centuries and 96 Fifties).", "index": 15}, {"record": "First player to have scored over 100 innings of 50+ runs in ODIs.", "index": 16}, {"record": "Appeared in most number of tests – 200. Kapil Dev is the next one with 131 test appearences.", "index": 17}, {"record": "Appeared in most number of ODIs – 463.", "index": 18}, {"record": "First player to score 200 runs in an ODI.", "index": 19}, {"record": "Tendulkar top-scored for India on 129 occasions – most such occasions for any player in ODIs.", "index": 20}, {"record": "He was the first players to complete the all-round treble of 10000 runs, 100 wickets and 100 catches.", "index": 21}, {"record": "Is the only player to have made three scores of 175 or more.", "index": 22}, {"record": "Is the only player with five scores of 150 or more.", "index": 23}, {"record": "Holds the record for scoring 1,000 ODI runs in a calendar year on most occasions. He did so seven times – 1994, 1996, 1997, 1998, 2000, 2003 and 2007", "index": 24}, {"record": "Tendulkar has scored over 1,000 ODI runs against all major Cricketing nations.", "index": 25}, {"record": "Has played ODIs with 866 players (teammates and opponents) – most for any player in ODI history.", "index": 26}, {"record": "He has most scores in 90s: 18 (including one not out innings).", "index": 27}, {"record": "He Was involved in 99 century partnerships – most by any player.", "index": 28}, {"record": "Tendulkar was the first batsman to score over 3,000 runs against an opponent (3,077 runs against Australia).Since then he has also done this against Sri Lanka (3,113 runs).", "index": 29}, {"record": "Tendulkar was the fastest to reach 10,000 runs taking 259 innings and has the highest batting average among batsmen with over 10,000 ODI runs.", "index": 30}, {"record": "Tendulkar is the only Indian to score a century on ODI captaincy debut (110 v Sri Lanka at Colombo RPS on 28 August 1996).", "index": 31}, {"record": "Tendulkar was the first Indian player to score a century and capture four wickets in the same ODI (v Australia at Dhaka on 28 October 1998).", "index": 32}, {"record": "11.27% of all the runs and 24.50% of all the hundreds scored by all Indian batsmen have come from Tendulkar’s bat.", "index": 33}, {"record": "His nine centuries against Australia are the most by any player against a particular country. He occupies the second place too, with eight centuries against Sri Lanka.", "index": 34}, {"record": "Sachin Tendulkar with Sourav Ganguly holds the world record for the maximum number of runs scored by the opening partnership. They put together 6,609 runs in 136 matches that include 21 century partnerships and 23 fifty run partnerships. The 21 century partnerships for the opening pair is also a world record.", "index": 35}, {"record": "Sachin Tendulkar and Rahul Dravid hold the world record for the highest partnership in ODIs when they scored 331 runs for the second wicket against New Zealand in 1999-00 at the Hyderabad.", "index": 36}, {"record": "Only the second player (after Javed Miandad) to appear in SIX World Cups – from 1992 to 2011.", "index": 37}, {"record": "Most ODI runs in a calendar year: 1,894 ODI runs in 1998.", "index": 38}, {"record": "Most Centuries in a calendar year: 9 ODI centuries in 1998.", "index": 39}, {"record": "Longest career span from India side: 24 years 1 day.", "index": 40}, {"record": "Between April 1990 and April 1998 Tendulkar played 185 consecutive matches – all time record.", "index": 41}, {"record": "He is the only player to be in top 10 ICC Batsmen ranking for 10 years in Tests.", "index": 42}, {"record": "He was the first cricketer to receive the Rajiv Gandhi Khel Ratna, India's highest sporting honor only to be followed by Mahendra Singh Dhoni.", "index": 43}, {"record": "In 2002, Wisden rated him as the second greatest Test batsman after Sir Donald Bradman.", "index": 44}, {"record": "In 2003, Wisden rated Tendulkar as the No. 1 and Richards at No. 2 in all time Greatest ODI players.", "index": 45}, {"record": "He was involved in unbroken 664-run partnership in a Harris Shield game in 1988 with friend and team mate Vinod Kambli.", "index": 46}, {"record": "Tendulkar is the only player to score a century in all three of his Ranji Trophy, Duleep Trophy and Irani Trophy debuts.", "index": 47}, {"record": "In 1992, at the age of 19, Tendulkar became the first overseas born player to represent Yorkshire.", "index": 48}, {"record": "Tendulkar has been granted the Rajiv Gandhi Khel Ratna, Arjuna Award, Padma Shri and Padma Vibhushan by Indian government. He is the only Indian cricketer to get all of them.", "index": 49}, {"record": "Tendulkar has scored over 1000 runs in a calendar year in ODIs 7 times.", "index": 50}, {"record": "Tendulkar has scored 1894 runs in calendar year in ODIs most by any batsman. These are most runs scored by a batsman in any season in ODI cricket. Tendulkar scored 9 centuries that year.", "index": 51}, {"record": "He has the least percentage of the man of the matches awards won when team loses a match in ODIs. Out of his 62-man of the match awards only 5 times India has lost.", "index": 52}, {"record": "Tendulkar most number man of match awards (12) against Australia cricket team.", "index": 53}, {"record": "In August 2003, Sachin Tendulkar was voted as the \"Greatest Sportsman\" of the country in the sport personalities category in the Best of India poll conducted by Zee News.", "index": 54}, {"record": "In November 2006, Time magazine named Tendulkar as one of the Asian Heroes.", "index": 55}, {"record": "The current India Poised campaign run by The Times of India has nominated him as the Face of New India next to the likes of Amartya Sen and Mahatma Gandhi among others.", "index": 56}, {"record": "Tendulkar was the first batsman to score over 50 centuries in international cricket.", "index": 57}, {"record": "Tendulkar was the first batsman to score over 75 centuries in international cricket.", "index": 58}, {"record": "Has the most overall runs in cricket, (ODIs+Tests+Twenty20s), as of December 2012 he had accumulated almost 34,074 runs overall.", "index": 59}, {"record": "The 22 century partnerships for opening pair with Sourav Ganguly is a world record.", "index": 60}, {"record": "Sachin Tendulkar and Rahul Dravid hold the world record for the highest partnership in ODI matches when they scored 331 runs against New Zealand in 1999", "index": 61}, {"record": "Sachin Tendulkar has been involved in six 200 run partnerships in ODI matches – a record that he shares with Sourav Ganguly and Rahul Dravid", "index": 62}, {"record": "Most ODI Centuries in a calendar year: 9 centuries in 1998.", "index": 63}, {"record": "Only player to have over 100 innings of 50+ runs (49 Centuries and 96 Fifties)(as of 7 March 2012)", "index": 64}, {"record": "The only player ever to cross the 14,000, 15,000, 16,000, 17,000, 18,000 run marks IN ODI.", "index": 65}, {"record": "Third highest individual score among Indian batsmen (200* against South Africa at Gwalior in 2011).", "index": 66}, {"record": "The score of 200* is the third highest score recorded in ODI matches.", "index": 67}, {"record": "Tendulkar has scored over 1000 ODI runs against all major Cricketing nations.", "index": 68}, {"record": "Sachin was the fastest to reach 10,000 runs taking 259 innings and has the highest batting average among batsmen with over 10,000 ODI runs", "index": 69}, {"record": "Most number of Stadium Appearances: 90 different Grounds.", "index": 70}, {"record": "Consecutive ODI Appearances: 185.", "index": 71}, {"record": "On his debut, Sachin Tendulkar was the second youngest debutant in the world.", "index": 72}, {"record": "When Tendulkar scored his maiden century in 1990, he was the second youngest to score a century.", "index": 73}, {"record": "Tendulkar's record of five test centuries before he turned 20 is a current world record.", "index": 74}, {"record": "Tendulkar holds the current record (217 against NZ in 1999/00 Season) for the highest score in Test cricket by an Indian when captaining the side.", "index": 75}, {"record": "Tendulkar has scored centuries against all test playing nations.[7] He was the third batman to achieve the distinction after Steve Waugh and Gary Kirsten.", "index": 76}, {"record": "He holds record for the second most number of seasons with over 1000 runs in world in a calendar year.", "index": 77}, {"record": "On 3 January 2007 Sachin Tendulkar (5751) edged past Brian Lara's (5736) world record of runs scored in Tests away from home.", "index": 78}, {"record": "Tendulkar and Brian Lara are the fastest to score 10,000 runs in Test cricket history. Both of them achieved this in 195 innings.", "index": 79}, {"record": "Second Indian after Sunil Gavaskar to make over 10,000 runs in Test matches.", "index": 80}, {"record": "Became the first Indian to surpass the 11,000 Test run mark and the third overall.", "index": 81}, {"record": "First to score 30,000 international runs.", "index": 82}, {"record": "Tendulkar's 33,906 runs in international cricket include 18,426 runs in ODIs, 15,470 Tests runs and 10 runs in the lone Twenty20 that India has played.", "index": 83}, {"record": "On 10 December 2005, Tendulkar made his 35th century in Tests at Delhi against Sri Lanka . He surpassed Sunil Gavaskar's record of 34 centuries to become the man with the most number of hundreds in Test cricket.", "index": 84}, {"record": "Tendulkar is the only player who has 150 wickets and more than 15,000 runs in ODIs.", "index": 85}, {"record": "Tendulkar is the first batsman in history to score 100 centuries in international cricket.", "index": 86}, {"record": "Holds the record for amassing most runs in a winning cause 11157 (average 56.63), including 33 centuries, in 234 matches.", "index": 87}, {"record": "Also has the highest average in a winning cause 56.63 which is the highest among the batsmen with 7000 runs or more in a winning cause.", "index": 88}, {"record": "He completed 50,000 runs on October 5, 2013.", "index": 89}, {"record": "He has got 20 ducks in ODI cricket.", "index": 90}, {"record": "He has scored most runs in boundaries (fours)in ODI cricket 2016*4= 8064.", "index": 91}, {"record": "He has scored 195 sixes in ODI cricket(Not most but in top 10).", "index": 92}, {"record": "He hit 25 boundaries in his unbeaten 200 against south africa , the first and most in a single ODI innings", "index": 93}, {"record": "He is the first battman who was declared out by \"Third Umpire\".", "index": 94}, {"record": "In 24 years, Tendulkar has played in 90 different venues which is a record. [13]", "index": 95}, {"record": "In the six World Cup appearances (1992 to 2011), Tendulkar has amassed 2,560 runs at an average of 56.95 – the most by any player in the history of the event.", "index": 96}, {"record": "Tendulkar has played with and against 989 international cricketers. That includes 141 Indian cricketers and 848 opponents which is a record", "index": 97}, {"record": "He is the first player getting \"Bharat Ratna\" and he is also the youngest person to get the same in any catagory.", "index": 98}, {"record": "He is the least percentage of awards for man of the match when the team has lost the match. Out of 62, team India has lost only for times which is a record.", "index": 99}]