[{"date": "23 Feb 1988", "year": "1988", "description": "Sachin Tendulkar, 14, and Vinod Kambli, 16 compile a 664-run unbroken partnership for Shardashram Vidyamandir against St Xavier's at Azad Maidan. Kambli makes 349 not out, Tendulkar 326 not out. It remains the highest partnership recorded in any form of cricket, until in November 2006 two schoolboys from Hyderabad - Manoj Kumar and Mohammad Shaibaz - overtake the record with an unbeaten 721-run partnership.", "title": "A monster in the making"}, {"date": "11 Dec 1988", "year": "1988", "description": "At 15, scores an unbeaten century against Gujarat at the Wankhede Stadium to become the youngest Indian to make a hundred on first-class debut. Was picked after Bombay captain Dilip Vengsarkar watched him negotiate Kapil Dev in the nets.", "title": "Truly first-class debut"}, {"date": "14 Dec 1989", "year": "1989", "description": "On the last day of the last Test of his first Test series, in Sialkot, gets hit on the nose by Waqar Younis - also in his first series. Falls down, gets up, and wipes away the gushing blood. Medical assistance is declined. Is eventually out for 57.", "title": "Bloody-minded to start with"}, {"date": "14 Aug 1990", "year": "1990", "description": "At 17 years and 112 days, becomes the then second-youngest centurion in Test history. His 119 not out against England at Old Trafford is a majestic rearguard action that enables India to hang on for a draw. It still remains among his most valuable Test innings.", "title": "How young is too young?"}, {"date": "02 Feb 1992", "year": "1992", "description": "Sculpts a counter-attacking gem of 114, after India fall from 135 for 6 to 159 for 8, at the WACA, the bounciest cricket pitch in the world. It is his favourite Test innings.", "title": "Crazy diamond"}, {"date": "01 Apr 1992", "year": "1992", "description": "Becomes the first overseas signing for Yorkshire.", "title": "Yorkshire opens up"}, {"date": "27 Nov 1992", "year": "1992", "description": "At 19 years and 217 days, becomes the youngest player to reach 1000 Test runs, during his 111 out of India's 227 in Johannesburg.", "title": "Thousand reasons to cheer"}, {"date": "11 Feb 1993", "year": "1993", "description": "Scores his first Test century at home. Hits 24 fours and a six in his 165 against England, as India win by an innings and 22 runs.", "title": "Mad in Madras"}, {"date": "24 Nov 1993", "year": "1993", "description": "With South Africa needing six runs to win off the last over of their Hero Cup semi-final against India, bowls a sensational over, giving them just three, and India victory.", "title": "Golden arm is unveiled"}, {"date": "27 Mar 1994", "year": "1994", "description": "Opens in an ODI for the first time - against New Zealand. Goes on to make 82 off 49 balls.", "title": "Opens a can of worms"}, {"date": "01 Oct 1995", "year": "1995", "description": "Signs a five-year contract worth Rs 31.5 crore with WorldTel, which makes him the richest cricketer in the world.", "title": "Commercial worth"}, {"date": "01 Mar 1996", "year": "1996", "description": "With 523 runs at 87.16, is the highest scorer in the World Cup held in India, Pakistan and Sri Lanka. Scores two centuries and three half-centuries.", "title": "His World Cup"}, {"date": "08 Aug 1996", "year": "1996", "description": "Is named captain of the Indian team, at age 23.", "title": "Captaincy, part I"}, {"date": "02 Jan 1998", "year": "1998", "description": "Is sacked from the captaincy after a 15-month tenure during which India won three out of 17 Tests.", "title": "End of captaincy, part I"}, {"date": "01 Mar 1998", "year": "1998", "description": "Gets his maiden first-class double-hundred and two hundreds and a fifty in three Tests against Australia. India win the home-series 2-1.", "title": "His finest series"}, {"date": "24 Apr 1998", "year": "1998", "description": "Scores two blazing, back-to-back hundreds against Australia at Sharjah to help India reach the final and then win it.", "title": "Desert Storm"}, {"date": "31 Jan 1999", "year": "1999", "description": "Makes 136 chasing 271 in Chennai against Pakistan with an injured back. Gets out with 17 runs to get; India fall short by 13.", "title": "His greatest innings... almost"}, {"date": "28 Jul 1999", "year": "1999", "description": "Is reappointed captain - without his consent - after India, under Mohammad Azharuddin, fail to reach the semifinals of the World Cup in England.", "title": "Captaincy, part II"}, {"date": "20 Mar 2001", "year": "2001", "description": "Scores a century in a famous decider of a famous series, against Australia. India win 2-1, denying Australia the \"final frontier\".", "title": "A thorn in Aussie flesh"}, {"date": "31 Mar 2001", "year": "2001", "description": "Becomes the first player to score 10,000 runs in one-day cricket in the course of his 139 against Australia in Indore.", "title": "The road less traveled"}, {"date": "19 Nov 2001", "year": "2001", "description": "Is cautioned and fined by match referee Mike Denness for trying to \"change the condition of the ball\" during the Port Elizabeth Test. The resulting outcry in India and the impasse between the Indian board and the ICC leads the latter to review the jurisdiction of match referees.", "title": "Ball-tampering?"}, {"date": "21 Dec 2001", "year": "2001", "description": "Is tied down by the over-the-stumps tactics of Ashley Giles in Bangalore, and is stumped for the first time in his Test career. It also highlights the start of his discomfort against left-arm spinners.", "title": "Caught out of his crease"}, {"date": "23 Aug 2002", "year": "2002", "description": "Overtakes Don Bradman's tally of 29 Test centuries, misses double-century by seven at Headingley, but India win by an innings and 46 runs.", "title": "Move over, Sir Don"}, {"date": "01 Mar 2003", "year": "2003", "description": "Scores 673 runs at 61.18 in the World Cup, taking India to within a win of the world crown. His 98 against Pakistan in an exceptionally anticipated match is one of the best knocks played by Indians at World Cups. Even though Australia are the champions, he is named the Man of the Series.", "title": "His World Cup, part II"}, {"date": "01 Aug 2003", "year": "2003", "description": "Draws flak for a duty waiver on the Ferrari 360 Modena, which is gifted to him by the Fiat group on his passing Bradman's mark of 29 Test centuries. Finally offers to pay the $245,000 duty, which is covered for by Fiat.", "title": "Privilege, what privilege?"}, {"date": "04 Jan 2004", "year": "2004", "description": "Scores a century without a cover-drive, goes on to get an unbeaten 241 in Sydney, and rates it the best among his centuries. Australia manage to hold on for a draw, and the series ends 1-1.", "title": "Economy over style"}, {"date": "29 Mar 2004", "year": "2004", "description": "Scores an unbeaten 194 in Sehwag's Multan Test. Later says he was surprised the Indian team declared with him so close to the double-century.", "title": "Robbed of a double?"}, {"date": "01 Aug 2004", "year": "2004", "description": "Tennis elbow surfaces, during the Videocon Cup in Holland. Misses the Champions Trophy in England, and then the first two home Tests against Australia.", "title": "Cost of playing catches up"}, {"date": "16 Mar 2005", "year": "2005", "description": "Becomes the fifth man to score 10,000 Test runs in course of his 52 against Pakistan in Kolkata. India win the match by 195 runs.", "title": "Ten thousand, twice over"}, {"date": "01 May 2005", "year": "2005", "description": "Goes for the surgery for the tennis elbow, misses a triangular in Sri Lanka, a tour to Zimbabwe, and the Super Series in Australia.", "title": "Tennis elbow refuses to go away"}, {"date": "25 Oct 2005", "year": "2005", "description": "Makes a roaring return to international cricket, with a 93 off 96 balls against Sri Lanka in Nagpur, in India's 350 for 6.", "title": "Back, and how"}, {"date": "10 Dec 2005", "year": "2005", "description": "In scoring 109 against Sri Lanka in Delhi, becomes the highest centurion in Test cricket, overtaking Sunil Gavaskar's 34.", "title": "Sunny days"}, {"date": "19 Mar 2006", "year": "2006", "description": "Struggles for 1 run in 33 minutes against England in Mumbai, and after he is dismissed, he is booed off the ground by his home crowd.", "title": "Home crowd turns hostile"}, {"date": "01 Mar 2006", "year": "2006", "description": "Goes to England for surgery on his right shoulder. Misses the one-dayers against England and the tour to West Indies.", "title": "Tryst with the knife"}, {"date": "14 Sep 2006", "year": "2006", "description": "Makes a stunning comeback, with 141 off 148 balls against West Indies in a DLF Cup ODI in Kuala Lumpur. India lose the match by D/L method.", "title": "Back and how, part II"}, {"date": "01 May 2007", "year": "2007", "description": "Is \"rested\" for the first time in his career, for the three-ODI series in Bangladesh. Scores two centuries in the two following Tests.", "title": "Unwanted rest"}, {"date": "01 Aug 2007", "year": "2007", "description": "With 228 runs at 38.00, makes a significant contribution to his first Test-series win outside the subcontinent, as India beat England 1-0 to win the Pataudi Trophy.", "title": "Finally, a win outside subcontinent"}, {"date": "04 Jan 2008", "year": "2008", "description": "At an SCG full of worshippers, scores a sublime unbeaten 154, his first century in more than two years and 19 Tests, against opposition other than Bangladesh.", "title": "Sachin Cricket Ground"}, {"date": "02 Mar 2008", "year": "2008", "description": "Scores his first ODI century in Australia, in first of the CB Series final. The innings is the foundation India build their first tri-series in Australia on.", "title": "Sachin Cricket Ground, Part II"}, {"date": "17 Oct 2008", "year": "2008", "description": "At 2.31pm on a hot Mohali Friday, Tendulkar steers debutant Peter Siddle towards the third-man boundary for three runs to break Brian Lara's record for most Test runs.", "title": "Scaling the summit"}, {"date": "05 Nov 2009", "year": "2009", "description": "Crosses 17,000 ODI runs during his 175 off 141 balls in a run-chase of 351 against Australia in Hyderabad. It is a chanceless innings that ends 19 runs short of the target, but India choke after his wicket and lose.", "title": "Solo again"}, {"date": "24 Feb 2010", "year": "2010", "description": "A stunning display in Gwalior makes Tendulkar the first male player to score 200 in a single innings in a one-day international. It comes off just 147 deliveries, powering India to 401 and a comfortable 153-run win against South Africa.", "title": "The 200 barrier falls"}, {"date": "01 Oct 2010", "year": "2010", "description": "Tendulkar wins his first ICC award, the Sir Garfield Sobers Trophy, by being named the Cricketer of the Year during the 2010 ICC Award ceremony in Bangalore. A week later he reclaims top spot in the ICC Test rankings for batsmen for the first time since 2002. He is also named in ESPNcricinfo's all-time Test World XI, the only presently active player to make the team.", "title": "Awards and rankings"}, {"date": "19 Dec 2010", "year": "2010", "description": "With India battling to save a Test, Tendulkar bats serenely against a difficult South African attack in Centurion to become the first man to score 50 Test hundreds.", "title": "A half-century of Test centuries"}, {"date": "02 Apr 2011", "year": "2011", "description": "After five unsuccessful attempts, Tendulkar finally gets his hands on the World Cup trophy as India win the tournament in style. He contributes handsomely to the win, scoring hundreds against England and South Africa, 85 in the semi-final against Pakistan, and is the second-highest run-getter in the tournament with 482 at an average of 53.55. During the course the tournament, he also becomes the first batsman to score 2000 runs and six centuries in World Cup matches.", "title": "World Cup glory, at last"}, {"date": "16 Mar 2012", "year": "2012", "description": "Finally, 34 innings and more than a year after scoring his 99th international hundred, Tendulkar reaches the landmark that might never be equalled, scoring 114 in an Asia Cup match against Bangladesh in Mirpur.", "title": "Century of centuries"}, {"date": "23 Dec 2012", "year": "2012", "description": "After playing 463 one-day internationals, Tendulkar announces his retirement from the format, just before the squad is announced for the home series against Pakistan. Tendulkar finishes with 18,426 ODI runs and 49 hundreds, well clear of any other batsman.", "title": "Goodbye to ODIs"}, {"date": "10 Oct 2013", "year": "2013", "description": "Having played 198 Tests, Tendulkar announces his retirement from his only active international format. With two Tests coming up against West Indies, he says his 200th Test will be his last.", "title": "Goodbye to Tests"}, {"date": "16 Nov 2013", "year": "2013", "description": "An emotional India bids farewell to Tendulkar on his home ground at the Wankhede Stadium, as West Indies lose the Test in seven sessions. It's Tendulkar's 200th Test, and a 24-year-old romance comes to an end.", "title": "The last day"},{"date": "16 Nov 2013", "year": "2013", "description": "The Government of India decided to award the Bharat Ratna to Sachin Tendulkar, who incidentally retired the same day in the morning after playing his 200th Test in Mumbai, and became the first sportsperson and the youngest to receive the award.", "title": "Bharat Ratna"}]